app/serializers/restaurant_serializer.rb

  def review
    object.reviews&&.average(:value)
---
SELECT AVG("reviews"."value") FROM "reviews" WHERE "reviews"."restaurant_id" = ?  [["restaurant_id", 1]]