app/controllers/restaurants_controller.rb

SELECT restaurants.*, (69.09332411348201 * ABS(restaurants.latitude - -23.5506507) * 0.7071067811865475) + (59.836573914187355 * ABS(restaurants.longitude - -46.6333824) * 0.7071067811865475) AS distance, CASE WHEN (restaurants.latitude >= -23.5506507 AND restaurants.longitude >= -46.6333824) THEN  45.0 WHEN (restaurants.latitude <  -23.5506507 AND restaurants.longitude >= -46.6333824) THEN 135.0 WHEN (restaurants.latitude <  -23.5506507 AND restaurants.longitude <  -46.6333824) THEN 225.0 WHEN (restaurants.latitude >= -23.5506507 AND restaurants.longitude <  -46.6333824) THEN 315.0 END AS bearing FROM "restaurants" WHERE (restaurants.latitude BETWEEN -23.840114266221693 AND -23.261187133778304 AND restaurants.longitude BETWEEN -46.94914686874913 AND -46.31761793125087) ORDER BY distance ASC
---
  def search
    @restaurants = Restaurant.search(
      name_or_description_cont: params[:q]
    ).result